// alert('Вітаємо!'); (повертає undefined)
// prompt('ведіть логін'); (повертає рядок, те що було введено або null)
// confirm('Чи є Вам 18 років?'); // true або false



// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().


// const number = Number(prompt('Введіть будь ласка число'));
// if(number === 10){
// alert('Вірно')
// }
// else{
// alert('Невірно');
// }



// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

// if(min <= 15){
// alert(`${min} входить в першу чверть`);
// }
// else if (min <= 30){
// alert(`${min} входить в другу чверть`);
// }
// else if (min <= 45){
// alert(`${min} входить в третю чверть`);
// }
// else {
// alert(`${min} входить в четверту чверть`);
// }


// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//const num = Number(prompt('Ведіть значення від 1 до 4 включно'));
//let result = 0;
//switch (num){
    //case 1:
       // result = 'зима';
   // break;
//case 2:
       // result = 'весна';
    //break;
    //case 3:
        //result = 'літо';
    //break;
    //case 2:
        //result = 'осінь';
    //break;
    //default:
       // result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
//}

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples
//"abc".padStart(8, "0");

//const min = Number(prompt('Введіть кількість хвилин'));
//const hours = String(Math.floor(num / 60).padStart(2,'0');
//const min =String(num % 60).padStart(2, '0');
//console.log (`${hours}:${min}');



// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

//let login = prompt('Введіть логін');
//console.log(login);
//if (login === 'Адмін'){
//let password = prompt('Ввеіть пароль');
//if(password === 'Я головний'){
    //alert('Добрий день!')}
//}
//else{
    //alert('Невірний пароль!');
//} else if(login === null){
//alert('Скасовано');
//}
//else{
    //alert('Я вас не знаю');
//}


// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
//let i = 0;
//while(i <= 20){
    //console.log(i);
    //i++;
//}

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

//function getNumbers(min, max){
//let sum = 0;
//for(let i = max; i >= min; i--){
    //console.log(i);
    //if(i % 2 === 0){
       // sum += i;
   // }
//}
    //return sum;
//}

//console.log(getNumbers (10, 5));



// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

//function min(a, b){
   // if (typeof a != 'number' || typeof b != 'number'){
        //return 'Not a number!'
   // }
    //if (a > b){
      //  return b;
   // } else{
       // return a;
   // }
//}

//return a > b ? b : a;

//return Math.min(a,b);

//console.log(min(2, 5));







// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).

//function isAdult(age){
   // return age >= 18 ? true : confirm('Вам є 18 років?');
//}
//console.log(isAdult());


// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

//function fizzBuzz(num){
    
    //for(let i = 0; i <= num; i++){
        //console.log(i);
        //if(i % 3 === 0 && i % 5 === 0){
            //console.loge('fizzbuzz');
       // } else if(i % 3 === 0){
//console.loge('fizz');
        //} else if(i % 5 === 0){
//console.loge('buzz');
    //}
    //}
//}
//fizzBuzz(15);

// 1. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt
//let temp;
//do {
//temp = prompt('Введіть число більше 100');

//}
//while (temp <= 100 && temp !== null);
//console.log(temp);







// 2. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

/* const url = "https://my-site.com/about";

function editUrl(url){
        if (url.endsWith('/')){
    //if (url[url.length-1] === '/'){
        return url;
    } else if(url.includes("my-site")){
return `${url}/`;
    }
    else{
        return url;
    }
}
console.log(editUrl("https://my-site.com/about")); */



/* 1. Оголошення змінних

Створи змінні:

username — рядок з твоїм ім’ям

age — число

isStudent — логічне значення

Виведи їх у консоль.  */

/* const username = 'Anna';
const age = 32;
const isStudent = true;
console.log(isStudent) */

/* 2. Типи даних

Завдання:
Створи 5 змінних різних типів:
num — число
text — рядок
isActive — логічне значення
notDefined — undefined
emptyValue — null
Виведи тип кожної змінної у консоль за допомогою typeof. */

/* const num = 20;
console.log(typeof num);
const text = 'GoIT';
console.log(typeof text);
const isActive = true;
console.log(typeof isActive);
const notDefined = undefined;
console.log(typeof notDefined);
const emptyValue = null;
console.log(typeof emptyValue); */


/* 3. Арифметичні операції 💻

Завдання:
Створи дві змінні:

let a = 10;
let b = 3;

Обчисли та виведи у консоль:
суму a + b
різницю a - b
добуток a * b
частку a / b
остачу від ділення a % b
Твій код повинен вивести 5 результатів у консоль. */

/* let a = 10;
let b = 3;
const resultSum = a + b;
console.log(resultSum);
const resultSubtraction = a - b;
console.log(resultSubtraction);
const resultMultiplication = a * b;
console.log(resultMultiplication);
const resultDivision = a / b;
console.log(resultDivision);
const resultPercentage = a % b;
console.log(resultPercentage); */

/* 4. Умовний оператор — перевірка віку
Завдання:
Створи змінну age і задай будь-яке число.
Напиши умову:
якщо age < 18 → вивести "Неповнолітній"
інакше → "Повнолітній"
Підказка: використовуй if...else */

/* let age = 22;
if(age < 18){
    console.log('Неповнолітній');
}else{
    console.log('Повнолітній');
}
console.log(age); */
/* 5. Парне чи непарне число

Завдання:
Створи змінну num і задай будь-яке число.
Використай оператор % (остача від ділення), щоб перевірити, чи число парне.
Виведи у консоль:
"Парне", якщо число ділиться на 2 без остачі
"Непарне", якщо остача є */

/* let num = 22;
if(num % 2 === 0){
    console.log("Парне");
}else{
    console.log("Непарне");
}
console.log(num);  */

/* 6. Перша функція

Завдання:
Створи функцію sayHello, яка:
не приймає параметрів
виводить у консоль "Привіт, світ!" */

/* function sayHello(){
    console.log('Привіт, світ!')
}
sayHello(); */

/* 7. Функція з параметром

Завдання:
Створи функцію greet(name), яка:
приймає один параметр name
повертає рядок "Привіт, <ім'я>!"
Наприклад, greet('Anna') → "Привіт, Anna!" */

/* let username = 'Anna';
function greet(username){
return `Привіт, ${username}!`;

}
console.log(greet(username)); */

/* 8. Функція для суми двох чисел

Завдання:
Створи функцію sum(a, b), яка:
приймає два числа a і b
повертає їх суму
Виклич функцію з будь-якими числами та виведи результат у консоль. */

/* function sum(a, b){
    return a + b;
}
console.log(sum(555, 245)); */

/* 9. Функція isAdult(age)

Завдання:

Створи функцію isAdult(age), яка:
приймає один параметр age
повертає true, якщо вік ≥ 18
повертає false, якщо вік < 18
Виклич функцію з будь-яким числом та виведи результат у консоль.
 */
/* let age = 11;
function isAdult(age){
if(age >= 18){
    return true;
} else{
    return false;
}
}
console.log(isAdult(age)); */

/* Умова:
Є число n.
let n = 7;

Потрібно:
За допомогою циклу for вивести таблицю множення для числа n
Множити n на числа від 1 до 10
Кожен результат виводити у форматі:

7 x 1 = 7
7 x 2 = 14
7 x 10 = 70

🔹 Обмеження:
використовувати for
без масивів
без функцій

🔹 Підказка (дуже мінімальна 😉)
цикл починається з 1
цикл закінчується на 10
всередині циклу використовуй console.log() */
  
/*    let n = 7;
for (let i = 1; i <= 10; i++) {
    console.log(`${n} x ${i} = ${n * i}`);
} */



/* 📝 Задача 2. Сума чисел (цикли + розгалуження)
Умова:

Є число n.
let n = 10;

Потрібно:
За допомогою циклу for пройти числа від 1 до n

Порахувати:
суму парних чисел
суму непарних чисел
Після циклу вивести у консоль:
Сума парних: ...
Сума непарних: ...

🔹 Обмеження:
використовувати for
використовувати if...else
без масивів
без функцій

🔹 Підказки (мінімальні):
створи дві змінні для сум
використовуй оператор %
перевіряй кожне число в циклі */

/* let n = 10;
let sumOfEven = 0;
let sumOfOdd = 0;
for (let i = 1; i <= n; i++){
 if(i % 2 === 0) {
     sumOfEven +=i;
 } else {
    sumOfOdd += i;
 }

}
console.log(sumOfEven, sumOfOdd); */

/* 📝 Задача: Виведення чисел за умовою
Умова:
Є число n.
let n = 15;

Потрібно:
За допомогою циклу for пройти числа від 1 до n
Для кожного числа:
якщо число ділиться на 3, вивести "Fizz"
якщо число ділиться на 5, вивести "Buzz"
інакше — просто вивести число
Виводити результат у консоль по одному рядку на число

🔹 Підказки:
Використовуй i % 3 === 0 і i % 5 === 0
Перевірку на 3 роби перед перевіркою на 5 (або навпаки, важливо розділити умови)
console.log() всередині циклу */
/*  let n = 15;

 for(let i = 1; i <= n; i++){
   
    if(i % 3 === 0){
        console.log('Fizz');
    } else if(i % 5 === 0){
        console.log('Buzz');
        
    } else{
        console.log(i);
    }
    
 } */
 